{
    "data": [
        {
            "name": "Chicken Pot Pie Soup",
            "recipe": {
                "1": "Heat butter in a large stockpot over medium-high heat until melted (or heat the olive oil until it is shimmering).  Add onion, carrots, and celery.  Saute for 6-7 minutes, stirring frequently, until the onion is soft and translucent.  Add in the garlic and mushrooms, and saute for an additional 2-3 minutes, stirring frequently, until the garlic is fragrant.",
                "2": "Stir in the flour until it is completely combined, and saute for an additional 1 minute, stirring occasionally.  Gradually add in the chicken stock and milk, stirring frequently.  Stir in the chicken, potatoes, corn, peas, Italian seasoning, salt and pepper until combined.",
                "3": "Bring the mixture to a simmer (be careful not to bring it to a boil!), stirring occasionally so that the bottom of the soup does not stick to the pan.  Then reduce heat to medium-low, and continue simmering the soup for 10-15 minutes until the potatoes are soft and cooked through.",
                "4": "Taste the soup and season with additional salt and pepper, if needed.",
                "5": "Serve immediately, with crackers on top or on the side, if desired"
            },
            "time": "35",
            "ingredients": {
                "1": "4 Tablespoons butter or olive oil",
                "2": "1 medium onion, peeled and diced",
                "3": "2 medium carrots, peeled and diced",
                "4": "2 celery stalks, diced",
                "5": "4 cloves garlic, peeled and minced",
                "6": "4 ounces button or baby bella mushrooms, diced",
                "7": "1/3 cup all-purpose or white whole wheat flour",
                "8": "3 cups chicken stock",
                "9": "2 cups milk",
                "10": "3 cups shredded cooked chicken",
                "11": "1 pound Yukon gold potatoes, diced",
                "12": "1 cup frozen corn",
                "13": "1 cup frozen peas",
                "14": "1 teaspoon Italian seasoning, homemade or store-bought",
                "15": "1/2 teaspoon salt",
                "16": "1/2 teaspoon freshly-cracked black pepper"
            },
            "description": "This Chicken Pot Pie Soup recipe is simple to make, lightened up with a few easy tweaks, and deliciously rich and creamy.",
            "serving_size": "8-10 servings",
            "image": "https://www.savingdessert.com/wp-content/uploads/2017/09/Chicken-Pot-Pie-Soup-2-2.jpg"
        },
        {
            "name": "Spagetti Carbonara",
            "recipe": {
                "1": "Heat a large stockpot of generously-salted water until boiling",
                "2": "In a measuring cup or medium mixing bowl, whisk together the eggs, egg yolks, grated cheese, plus a few twists of freshly-cracked black pepper until combined.  Set aside for later.",
                "3": "Meanwhile, cook the guanciale (or pancetta/bacon) in a large sauté pan over medium-high heat until browned and slightly-crispy, about 7 minutes.  Remove pan from the heat, use a slotted spoon to transfer the guanciale to a clean plate (leaving the leftover grease in the pan) and set both aside for later.",
                "4": "Add the pasta to the boiling water and cook until 1 minute shy of al dente.  Midway through, use a measuring cup to carefully scoop out about 1 cup of the starchy pasta water.  Then while vigorously whisking the egg mixture with one hand, very slowly drizzle the hot water into the eggs with your other hand until the water is incorporated.  (Be sure to constantly whisk the eggs, or else they will scramble!)",
                "5": "Once the pasta is nearly al dente and ready to go, use tongs or a spider spoon to transfer the pasta immediately from the stockpot to the large sauté pan with the bacon grease.  Place the sauté pan over medium heat, add an additional 1/2 cup of the starchy pasta water to the pasta, then toss, toss, toss the pasta for 1 minute until it is al dente",
                "6": "Then, using one hand to continue tossing the pasta, use your other hand to slowly drizzle the egg mixture into the pasta and toss until combined.  (Do not add the eggs too quickly or they will scramble!)  Continue tossing until the eggs form a glossy sauce that coats all of the pasta, adding in extra scoops of starchy pasta water if needed to thin out the sauce.  Add the guanciale and toss to combine",
                "7": "Serve immediately, garnished with an extra crack of black pepper (plus extra grated cheese, if desired)."
            },
            "time": "35",
            "ingredients": {
                "1": "1 pound (or 500 grams) thick spaghetti (or your preferred pasta shape)",
                "2": "2 large eggs",
                "3": "4 large egg yolks",
                "4": "2 ounces (60 g) freshly-grated Pecorino Romano or Parmesan cheese",
                "5": "sea salt and freshly-cracked black pepper",
                "6": "7 ounces (200 g) diced guanciale (or pancetta or thick-cut bacon)"
            },
            "description": "",
            "serving_size": "4-6 servings",
            "image": "https://foodiemail.com/wp-content/uploads/2020/07/carbonara-scaled.jpg"
        },
        {
            "name": "Hard Boiled Eggs",
            "recipe": {
                "1": "Gently place your eggs in an empty saucepan or stockpot, and then fill the pan with cold water so that there is at least 1 inch of water on top of the eggs (if using 6 or less eggs), or 1.5-2 inches of water on top of the eggs (if using 7-14 eggs)",
                "2": "Transfer pan to the stove (uncovered) and heat over medium-high heat until the water reaches a rolling boil.  Let the eggs boil for 1 minute (no more).  Then remove the pan from the heat, and cover snugly with a lid.  Let the eggs continue to cook in the pan for 9-11* minutes, or until the yolks reach your desired level of donenes",
                "3": "Carefully drain out the hot water (or you can also transfer the eggs to a colander, and then return them to the pot).  Then fill the pot with ice water, and let the eggs sit for a few minutes until they are completely chilled",
                "4": "Peel and serve the eggs immediately.  Or transfer them to a sealed container and refrigerate for up to 1 week",
                "5": "Granted, different pots/stoves may cause the eggs to cook more/less quickly, so test what cooking time will work best in your kitchen.  I’ve found a good solid 10 minutes of cooking time works best for me."
            },
            "time": "18",
            "ingredients": {
                "1": "eggs (preferably 1+ week old)"                
            },
            "description": "Learn how to make perfectly hard-boiled eggs with this simple method!",
            "serving_size": "12 eggs",
            "image": "https://www.wholesomeyum.com/wp-content/uploads/2019/04/wholesomeyum-Perfect-Baked-Hard-Boiled-Eggs-In-The-Oven-14.jpg"
        },
        {
            "name": "Baked Potato",
            "recipe": {
                "1": "Heat oven to 450°F.  Line a large baking sheet with foil (or parchment*), and if you happen to own a wire cooling rack, place it on top of the baking sheet",
                "2": "Using a dinner fork or a small paring knife, poke the potato at least 10 times on all sides.  Place the potato on the prepared baking sheet",
                "3": "Bake for 25 minutes.  Remove baking sheet from the oven",
                "4": "Using a pastry brush, brush the outside of the potato with melted butter or olive oil until it is completely coated on all sides.  Sprinkle the potato with a generous pinch of Kosher salt, and place the potato back on the baking sheet reverse-side-up, so that it can cook evenly on both sides",
                "5": "Bake for an additional 20 minutes.  Using an oven mitt, carefully squeeze the potato to check for doneness.  If the insides are soft and give under pressure, remove the potato from the oven.  Otherwise, continue cooking in 5-minute increments until the potato is soft",
                "6": "Using a small paring knife, slice halfway through the potato lengthwise.  Then give it a gentle squeeze to open",
                "7": "Serve immediately, with your desired toppings."
            },
            "time": "52",
            "ingredients": {
                "1": "1 medium-to-large Russet potato, scrubbed clean of any dirt",
                "2": "1–2 teaspoons melted butter (or olive oil)",
                "3": "pinch of coarse Kosher salt",
                "4": "pinch of freshly-cracked black pepper"
            },
            "description": "Learn how to make the perfect baked potato using this step-by-step tutorial and recipe. So easy and delicious!",
            "serving_size": "1 serving",
            "image": "https://www.simplyrecipes.com/thmb/GZwoVSMKQ2tiBKner6bDmCXJPi0=/1600x1067/filters:fill(auto,1)/Twice-Baked-Potatoes-LEAD-1v2-f7918849ddd245c5aecf0ec58fb2b47e.jpg"
        }
    ]
}